#Найдите сумму цифр трехзначного числа.
#Пример:
#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0)

num = int(input('Введите трехзначное число: '))
num1 = num // 100
num2 = (num // 10) % 10
num3 = num % 10
print(num1 + num2 + num3)